Repository: GNOME/tinysparql
Catalog: po/*.po
Languages: fur, kk

source: No results were found matching your query
fur: Nissun risultât cjatât che al corispuint ae interogazion

source: Search term “%s” is a stop word.
fur: Il tiermin di ricercje «%s» al è une peraule di ferme.

source: Stop words are common words which may be ignored during the indexing process.
fur: Lis peraulis di ferme a son peraulis di ûs comun che a puedin jessi ignoradis dilunc il procès de metude in indiç.

source: Path to use to run a query or update from file
fur: Percors di doprâ par eseguî une interogazion o un inzornament furnint un file
kk: Файлдан сұрауды орындау немесе жаңарту үшін пайдаланылатын жол

source: SPARQL query
fur: Interogazion SPARQL
kk: SPARQL сұранымы

source: This is used with --query and for database updates only.
fur: Chest al ven doprât cun --query e par inzornaments de base di dâts.
kk: Бұл тек --query опциясымен және дерекқорды жаңарту үшін пайдаланылады.

source: Retrieve classes
fur: Recuperâ classis

source: Retrieve class prefixes
fur: Recuperâ prefìs des classis

source: Retrieve properties for a class, prefixes can be used too (e.g. rdfs:Resource)
fur: Al recupere lis proprietâts di une classe, a puedin jessi doprâts ancje i prefìs (p.e. rdfs:Resource)

source: CLASS
fur: CLASSE
kk: КЛАСС

source: Retrieve classes which notify changes in the database (CLASS is optional)
fur: Al recupere lis classis che a notifichin modifichis te base di dâts (CLASSE al è opzionâl)

source: Retrieve indexes used in database to improve performance (PROPERTY is optional)
fur: Al recupere i indiçs doprâts te base di dâts par miorâ lis prestazions (PROPRIETÂT al è opzionâl)

source: PROPERTY
fur: PROPRIETÂT

source: Describe subclasses, superclasses (can be used with -s to highlight parts of the tree and -p to show properties)
fur: Al descrîf lis sot-classis, super-classis (al pues jessi doprât cun -s par evidenziâ parts dal arbul e cun -p par mostrâ lis proprietâts)
kk: Субкластарды, суперкластарды сипаттау (ағаштың бөліктерін ерекшелеу үшін -s және қасиеттерді көрсету үшін -p аргументтерімен қолдануға болады)

source: Search for a class or property and display more information (e.g. Document)
fur: Cîr une classe o une proprietât e mostre plui informazions (p.e. Document)
kk: Класты немесе қасиетті іздеу және көбірек ақпаратты көрсету (мысалы, Document)

source: CLASS/PROPERTY
fur: CLASSE/PROPRIETÂT
kk: КЛАСС/ҚАСИЕТ

source: Returns the shorthand for a class (e.g. nfo:FileDataObject).
fur: Torne il non sempliç di une classe (p.e. nfo:FileDataObject).

source: Returns the full namespace for a class.
fur: Al torne il spazi dai nons (namespace) complet di une classe.

source: Remote service to query to
fur: Servizi rimot di interogâ

source: BASE_URL
fur: URL_BASE

source: Could not get namespace prefixes
fur: Impussibil otignî i prefìs dal spazi dai nons (namespace)

source: No namespace prefixes were found
fur: Nissun prefìs dal spazi dai nons (namespace) cjatât

source: None
fur: Nissun
kk: Ешнәрсе

source: Could not create tree: subclass query failed
fur: Impussibil creâ l'arbul: interogazion sot-classe falide
kk: Ағашты жасау мүмкін емес: ішкі класс сұранымы сәтсіз аяқталды

source: Could not create tree: class properties query failed
fur: Impussibil creâ l'arbul: interogazion proprietât classe falide
kk: Ағашты жасау мүмкін емес: класс қасиеттерінің сұранымы сәтсіз аяқталды

source: Could not list classes
fur: Impussibil listâ lis classis
kk: Кластар тізімін шығару мүмкін емес

source: No classes were found
fur: No je stade cjatade nissune classe

source: Classes
fur: Classis
kk: Кластар

source: Could not list class prefixes
fur: Impussibil listâi prefìs di classe

source: No class prefixes were found
fur: Nol è stât cjatât nissun prefìs di classe

source: Prefixes
fur: Prefìs

source: Could not find property for class prefix, e.g. :Resource in “rdfs:Resource”
fur: Impussibil cjatâ la proprietât pal prefìs de classe, p.e. :Risorse in «rdfs:Resource»

source: Could not list properties
fur: Impussibil listâ lis proprietâts
kk: Қасиеттерді тізімдеу мүмкін емес

source: No properties were found
fur: No je stade cjatade nissune proprietât

source: Properties
fur: Proprietâts
kk: Қасиеттері

source: Could not find notify classes
fur: Impussibil cjatâ lis classis di notifiche
kk: Хабарландыру кластары табылмады

source: No notifies were found
fur: No je stade cjatade nissune notifiche

source: Notifies
fur: Notifichis
kk: Хабарландырулар

source: Could not find indexed properties
fur: Impussibil cjatâ lis proprietâts metudis in indiç
kk: Индекстелген қасиеттер табылмады

source: No indexes were found
fur: Nol è stât cjatât nissun indiç

source: Indexes
fur: Indiçs
kk: Индекстер

source: Could not search classes
fur: Impussibil cirî lis classis
kk: Кластарды іздеу мүмкін емес

source: No classes were found to match search term
fur: No je stade cjatade nissune classe che e corispuint al tiermin cirût

source: Could not search properties
fur: Impussibil cirî lis proprietâts
kk: Қасиеттерді іздеу мүмкін емес

source: No properties were found to match search term
fur: No je stade cjatade nissune proprietât che e corispuint al tiermin cirût

source: Could not get UTF-8 path from path
fur: Impussibil otignî un percors UTF-8 dal percors
kk: Жолдан UTF-8 жолын алу мүмкін болмады

source: Could not read file
fur: Impussibil lei il file
kk: Файлды оқу мүмкін емес

source: Could not run update
fur: Impussibil eseguî l'inzornament
kk: Жаңарту жөнелту мүмкін емес

source: Could not run query
fur: Impussibil eseguî la interogazion
kk: Сұранымды жөнелту мүмкін емес

source: No results found matching your query
fur: Nissun risultât cjatât che al corispuint ae interogazion
kk: Сұрауыңызға сәйкес нәтижелер табылмады

source: File and query can not be used together
fur: File e interogazion no puedin jessi doprâts adun
kk: Файлды және сұрауды бірге пайдалануға болмайды

source: The --list-properties argument can only be empty when used with the --tree argument
fur: L'argoment --list-properties al pues jessi vueit nome se doprât cul argoment --tree
kk: --list-properties аргументі тек --tree аргументімен бірге қолданылғанда ғана бос болуы мүмкін

source: Path to use to run a query from file
fur: Percors di doprâ par eseguî une interogazion furnint un file
kk: Файлдан сұрауды орындау үшін пайдаланылатын жол

source: SQL query
fur: Interogazion SQL
kk: SQL сұранымы

source: Failed to initialize data manager
fur: No si è rivâts a inizializâ il gjestôr di dâts
kk: Деректер менеджерін инициализациялау сәтсіз аяқталды

source: Empty result set
fur: Cumbinazion di risultâts vueide
kk: Бос нәтиже жиыны

source: Show statistics for current index / data set
fur: Mostre statistichis sui dâts/indiç atuâi

source: Show statistics about ALL RDF classes, not just common ones which is the default (implied by search terms)
fur: Mostre statistichis su DUTIS lis classis RDF, no nome chês comuns come di impostazion predefinide (implicit dai tiermins di ricercje)

source: Collect debug information useful for problem reporting and investigation, results are output to terminal
fur: Tire sù informazions di debug utilis pe segnalazion e risoluzion di problemis, i risultâts a son stampâts sul terminâl

source: Could not get Tracker statistics
fur: Impussibil otignî lis statistichis di Tracker

source: No statistics available
fur: Nissune statistiche disponibile

source: Statistics:
fur: Statistichis:

source: Disk Information
fur: Informazions disc

source: Remaining space on database partition
fur: Spazi restant su la partizion de base di dâts

source: Data Set
fur: Dimension dâts

source: Configuration
fur: Configurazion

source: No configuration was found
fur: No je stade cjatade nissune configurazion

source: States
fur: Stâts

source: Data Statistics
fur: Statistichis dâts

source: No connection available
fur: Nissune conession disponibile

source: Could not get statistics
fur: Impussibil otignî lis statistichis

source: No statistics were available
fur: Nissune statistiche disponibile

source: Database is currently empty
fur: La base di dâts e je vueide

source: Could not get basic status for Tracker
fur: Impussibil otignî il stât di Tracker

source: Currently indexed
fur: Za metût in indiç

source: Data is still being indexed
fur: La metude in indiç dai dâts e je ancjemò in vore

source: Estimated %s left
fur: Si stime che a mancjin %s

source: All data miners are idle, indexing complete
fur: Ducj i estratôrs a son inatîfs, metude in indiç completade

source: List all tags (using FILTER if specified; FILTER always uses logical OR)
fur: Liste dutis lis etichetis (doprant FILTRI se specificât, FILTRI al dopre simpri il OR logjic)

source: FILTER
fur: FILTRI

source: Show files associated with each tag (this is only used with --list)
fur: Mostre i file associâts cun ognidune etichete (doprade nome cun --list)

source: Add a tag (if FILEs are omitted, TAG is not associated with any files)
fur: Zonte une etichete (se FILE al è ometût, ETICHETE no ven associade a nissun file)

source: TAG
fur: ETICHETE

source: Delete a tag (if FILEs are omitted, TAG is removed for all files)
fur: Elimine une etichete (Se FILE al è ometût, ETICHETE e je gjavade di ducj i file)

source: Description for a tag (this is only used with --add)
fur: Descrizion par une etichete (doprade nome cun --add)

source: STRING
fur: STRINGHE

source: Use AND for search terms instead of OR (the default)
fur: Dopre AND invezit di OR (predefinît) pai tiermins cirûts

source: Could not get file URNs
fur: Impussibil otignî i URN dal file

source: Could not get files related to tag
fur: Impussibil otignî i file relatîfs ae etichete

source: Could not get all tags in the database
fur: Impussibil otignî dutis lis etichetis te base di dâts

source: No files have been tagged
fur: Nissun file al è stât etichetât

source: Could not get files for matching tags
fur: Impussibil otignî i file che a corispuindin a lis etichetis

source: No files were found matching ALL of those tags
fur: Nissun file al è stât cjatât che al corispuindi a DUTIS chês etichetis

source: Could not get all tags
fur: Impussibil otignî dutis lis etichetis

source: No tags were found
fur: No je stade cjatade nissune etichete

source: Tags (shown by name)
fur: Etichetis (mostradis par non)

source: No files were modified
fur: Nissun file al è stât modificât

source: Files do not exist or aren’t indexed
fur: I file no esistin o no son metûts in indiç

source: Tag was added successfully
fur: Zonte de etichete riessude

source: Could not add tag to files
fur: Impussibil zontâ la etichete ai file

source: Tagged
fur: Etichetât

source: Not tagged, file is not indexed
fur: No etichetât, il file nol è metût in indiç

source: Could not get tag by label
fur: Impussibil otignî la liste des etichetis

source: No tags were found by that name
fur: No je stade cjatade nissune etichete cun chel non

source: None of the files had this tag set
fur: Nissun dai file al veve impuestât cheste etichete

source: Tag was removed successfully
fur: Etichete gjavade cun sucès

source: Untagged
fur: Cence etichete

source: File not indexed or already untagged
fur: File no metût in indiç o etichete za gjavade

source: The --list option is required for --show-files
fur: La opzion --list e covente par --show-files

source: The --and-operator option can only be used with --list and tag label arguments
fur: La opzion --and-operator e pues jessi doprade nome cun --list e nons di etichetis

source: Add and delete actions can not be used together
fur: Lis azions "zonte" e "elimine" no puedin jessi dopradis adun

source: The --description option can only be used with --add
fur: La opzion --description e pues jessi doprade nome cun --add

source: Disable shutting down after 30 seconds of inactivity
fur: Disabilite il distudâ dopo 30 seconts di no ativitât

source: — start the tracker writeback service
fur: — tache il servizi di scriture rimandade di tracker

source: Saved queries
fur: Interogazions salvadis

source: Location of the database
kk: Дерекқор орны

source: DIR
kk: БУМА

source: Specify the DBus name of this endpoint
kk: Осы соңғы нүктенің DBus атын көрсетіңіз

source: NAME
kk: АТЫ

source: Specify the ontology name used in this endpoint
kk: Осы соңғы нүктеде қолданылатын онтология атын көрсетіңіз

source: Specify a path to an ontology to be used in this endpoint
kk: Осы соңғы нүктеде қолданылатын онтологияға баратын жолды көрсетіңіз

source: HTTP port
kk: HTTP порты

source: Whether to only allow HTTP connections in the loopback device
kk: HTTP байланыстарын тек ішкі тұйықталу (loopback) құрылғысында рұқсат ету ма

source: Use session bus
kk: Сессия шинасын қолдану

source: Use system bus
kk: Жүйелік шинаны қолдану

source: List SPARQL endpoints available in DBus
kk: DBus-та қолжетімді SPARQL соңғы нүктелерін тізімдеу

source: List network-local HTTP SPARQL endpoints
kk: Жергілікті желідегі HTTP SPARQL соңғы нүктелерін тізімдеу

source: --list can only be used with --session or --system
kk: --list опциясын тек --session немесе --system опцияларымен бірге қолдануға болады

source: One “ontology” or “ontology-path” option should be provided
kk: «ontology» немесе «ontology-path» опцияларының бірі көрсетілуі тиіс

source: --http-port cannot be used with --dbus-service
kk: --http-port опциясын --dbus-service опциясымен бірге қолдануға болмайды

source: Creating HTTP endpoint at %s…
kk: %s адресінде HTTP соңғы нүктесі жасалуда…

source: Listening to SPARQL commands. Press Ctrl-C to stop.
kk: SPARQL командалары тыңдалуда. Тоқтату үшін Ctrl-C басыңыз.

source: Closing connection…
kk: Байланысты жабу…

source: Creating endpoint at %s…
kk: %s адресінде соңғы нүкте жасалуда…

source: Could not own DBus name
kk: DBus атын иелену мүмкін емес

source: DBus name lost
kk: DBus атауы жоғалған

source: Opening database at %s…
kk: %s адресіндегі дерекқор ашылуда…

source: Creating in-memory database
kk: Жадтағы дерекқорды жасау

source: New database created. Use the “--dbus-service” option to share this database on a message bus.
kk: Жаңа деректер базасы жасалды. Осы деректер базасын хабарламалар шинасында бөлісу үшін «--dbus-service» опциясын қолданыңыз.

source: FILE
kk: ФАЙЛ

source: Connects to a DBus service
kk: DBus қызметіне қосылады

source: DBus service name
kk: DBus қызметінің аты

source: Output results format: “turtle”, “trig” or “json-ld”
kk: Шығыс нәтижелерінің пішімі: «turtle», «trig» немесе «json-ld»

source: RDF_FORMAT
kk: RDF_ПІШІМІ

source: Connects to a remote service
kk: Қашықтағы қызметке қосылады

source: Remote service URI
kk: Қашықтағы қызмет URI-ы

source: Output TriG format which includes named graph information
kk: Аталған граф ақпаратын қамтитын шығыс TriG пішімі

source: Specify one “--database”, “--dbus-service” or “--remote-service” option
kk: «--database», «--dbus-service» немесе «--remote-service» опцияларының бірін көрсетіңіз

source: Read TriG format which includes named graph information
kk: Атаулы графтар ақпаратын қамтитын TriG пішімін оқу

source: Could not run import
kk: Импортты орындау мүмкін емес

source: Lists all available classes
kk: Барлық қолжетімді кластарды тізімдейді

source: Lists all available prefixes
kk: Барлық қолжетімді префикстерді тізімдейді

source: Lists all classes which notify changes in the database
kk: Дерекқордағы өзгерістер туралы хабарлайтын барлық кластарды тізімдейді

source: List indexes used in database to improve performance
kk: Өнімділікті арттыру үшін дерекқорда қолданылатын индекстерді тізімдеу

source: Retrieve all named graphs
kk: Барлық атаулы графтарды алу

source: Lists all available properties
kk: Барлық қолжетімді қасиеттерді тізімдейді

source: Namespaces
kk: Атау кеңістіктері

source: Could not list named graphs
kk: Атаулы графтарды тізімдеу мүмкін емес

source: Named graphs
kk: Атаулы графтар

source: Get help on how to use TinySPARQL and any of these commands
kk: TinySPARQL және осы командалардың кез келгенін қолдану туралы көмек алу

source: Create a SPARQL endpoint
kk: SPARQL соңғы нүктесін жасау

source: Export data from a TinySPARQL database
kk: TinySPARQL дерекқорынан деректерді экспорттау

source: Import data into a TinySPARQL database
kk: TinySPARQL дерекқорына деректерді импорттау

source: Introspect a SPARQL endpoint
kk: SPARQL соңғы нүктесін интроспекциялау

source: Query and update the index using SPARQL
kk: SPARQL көмегімен index-ті сұрау және жаңарту

source: Create a Web IDE to query local databases
kk: Жергілікті дерекқорларды сұрау үшін Web IDE жасау

source: Available tinysparql commands are:
kk: Қолжетімді tinysparql командалары:

source: See “tinysparql help <command>” to read about a specific subcommand.
kk: Белгілі бір ішкі команда туралы оқу үшін «tinysparql help <command>» қараңыз.

source: “%s” is not a tinysparql command. See “tinysparql --help”
kk: «%s» — tinysparql командасы емес. «tinysparql --help» қараңыз

source: Provides an argument for a query parameter.
kk: Сұрау параметрі үшін аргумент береді.

source: PARAMETER:TYPE:VALUE
kk: ПАРАМЕТР:ТИП:МӘН

source: Invalid argument string %s
kk: %s аргумент жолы жарамсыз

source: Invalid parameter type for argument %s
kk: %s аргументі үшін параметр типі жарамсыз

source: A database path must be specified
kk: Дерекқор жолы көрсетілуі тиіс

source: Port to listen on
kk: Тыңдалатын порт

source: Port not specified
kk: Порт көрсетілмеген

source: Creating Web IDE at %s…
kk: %s адресінде Web IDE жасалуда…

source: Version
kk: Нұсқасы
