Repository: GNOME/tinysparql
Catalog: po/*.po
Languages: fur, kk

source: All posts
fur: Ducj i articui

source: By usage
fur: Par ûs

source: unknown time
fur: timp no cognossût

source: less than one second
fur: mancul di un secont

source: %d day
fur: %d dì

source: %2.2d hour
fur: %2.2d ore

source: %2.2d minute
fur: %2.2d minût

source: %2.2d second
fur: %2.2d secont

source: Maximum length of a word to be indexed
fur: Massime lungjece di une peraule di meti in indiç

source: Words with more characters than this length will be ignored by the indexer.
fur: Peraulis cun plui caratars di cheste lungjece no vegnaran metudis in indiç.

source: Maximum number of words to index in a document
fur: Massim numar di peraulis di meti in indiç intun document

source: Indexer will read only this maximum number of words from a single document.
fur: L'indicizadôr al learà nome chest numar massim di peraulis di un singul document.

source: Enable stemmer
fur: Abilite stemmer

source: Simplify the words to their root to provide more results. E.g. “shelves” and “shelf” to “shel”
fur: Semplifiche la peraule te lôr lidrîs par vê plui risultâts. Par esempli: «cjacare», «cjacari», «cjacarai» in «cjacar»

source: Enable unaccent
fur: Abilite letaris cence acent

source: Translate accented characters to the equivalent unaccented. E.g. “Idéa” to “Idea” for improved matching.
fur: Volte i caratars cun acent intai ecuivalents cence acent. Par esempli: «bruntulâ» in «bruntula».

source: Ignore numbers
fur: Ignore i numars

source: If enabled, numbers will not be indexed.
fur: Se abilitât, i numars no vegnaran metûts in indiç.

source: Ignore stop words
fur: Ignore lis peraulis di ferme

source: If enabled, the words listed in the stop-words list are ignored. E.g. common words like “the”, “yes”, “no”, etc.
fur: Se abilitât, lis peraulis listadis te liste des peraulis di ferme a vegnaran ignoradis. Par esempli peraulis come «sì», «no», «il» e vie indenant.

source: Maximum size of journal
fur: Dimension massime dal gjornâl

source: Size of the journal at rotation in MB. Use -1 to disable rotating.
fur: Dimension dal gjornâl ae rotazion in MB. Doprâ -1 par disabilitâ la rotazion.

source: Location of journal pieces
fur: Posizion dai tocs di gjornâl

source: Where to store a journal chunk when it hits the max size.
fur: Dulà salvâ un toc di gjornâl cuant che al rive ae dimension massime.

source: Error starting “tar” program
fur: Erôr tal inviâ il program «tar»

source: No error given
fur: Nissun erôr furnît
kk: Қате көрсетілмеген

source: Unknown error, “tar” exited with status %d
fur: Erôr no cognossût: «tar» al è jessut cul stât %d

source: Operation not supported
fur: Operazion no supuartade

source: Pause application and reason match an already existing pause request
fur: La aplicazion in pause e la sô reson a corispuindin a une domande esistente

source: Cookie not recognized to resume paused miner
fur: Cookie no ricognossût par continuâ l'estratôr di dâts

source: Data store is not available
fur: L'archivi dâts nol è disponibil

source: No network connection
fur: Nissune conession di rêt

source: Indexing not recommended on this network connection
fur: No si consee di meti in indiç su cheste conession

source: Applications
fur: Aplicazions

source: Applications data miner
fur: Estratôr di dâts des aplicazions

source: Logging, 0 = errors only, 1 = minimal, 2 = detailed and 3 = debug (default=0)
fur: Regjistrazion: 0 = nome erôrs, 1 = minimâl, 2 = detaiade, 3 = debug (predefinît=0)

source: Runs until all applications are indexed and then exits
fur: Reste in esecuzion fintremai che dutis lis aplicazions a son metudis in indiç, po dopo jes

source: Displays version information
fur: Mostre informazions su la version

source: — start the application data miner
fur: — invie l'estratôr dâts des aplicazions

source: Tracker Application Miner
fur: Estratôr di dâts des aplicazions

source: Indexes information about applications installed
fur: Met in indiç informazions su aplicazions instaladis

source: File system data miner
fur: Estratôr di dâts dal file system

source: Log verbosity
fur: Detais regjistri

source: Log verbosity.
fur: Detais dal regjistri.

source: Initial sleep
fur: Pause iniziâl

source: Initial sleep time, in seconds.
fur: Pause iniziâl, in seconts.

source: Scheduler priority when idle
fur: Prioritât dal planificadôr cuant che al sta inatîf

source: The scheduler is the kernel component that decides which runnable application will be executed by the CPU next. Each application has an associated scheduling policy and priority.
fur: Il planificadôr al è chel component dal kernel che al decît cuale aplicazion e vegnarà eseguide subite dopo sul processôr. Ogni aplicazion e à assegnât une politiche e une prioritât di planificazion.

source: Throttle
fur: Regoladôr

source: Indexing speed, the higher the slower.
fur: Velocitât di metude in indiç: plui alt il valôr, plui al sarà lent.

source: Low disk space limit
fur: Limit dal spazi su disc bas

source: Disk space threshold in percent at which to pause indexing, or -1 to disable.
fur: Liminâr in percentuâl dal spazi su disc dulà meti in pause la metude in indiç o -1 par disabilitâlu.

source: Crawling interval
fur: Interval acuisizion dâts

source: Interval in days to check whether the filesystem is up to date in the database. 0 forces crawling anytime, -1 forces it only after unclean shutdowns, and -2 disables it entirely.
fur: Interval in dîs par controlâ se il file system al è inzornât te base di dâts. 0 al sfuarce la acuisizion in cualsisei moment, -1 nome dopo che il sisteme si è fermât in maniere no juste, -2 lu disabilite.

source: Removable devices’ data permanence threshold
fur: Liminâr di permanence dai dâts tai dispositîfs estraibii

source: Threshold in days after which files from removables devices will be removed from database if not mounted. 0 means never, maximum is 365.
fur: Limit in dîs daspò i cuai i file di dispositîfs estraibii no plui montâts a vegnin gjavâts de base di dâts. 0 al indiche mai, il massim al è 365.

source: Enable monitors
fur: Abilite il monitorâ

source: Set to false to completely disable any file monitoring
fur: Met a FALS par disabilitâ il monitorizâ dai file

source: Enable writeback
fur: Abilite la scriture rimandade

source: Set to false to completely disable any file writeback
fur: Met a FALS par disabilitâ dal dut cualsisei scriture rimandade (writeback)

source: Index removable devices
fur: Met in indiç dispositîfs estraibii

source: Set to true to enable indexing mounted directories for removable devices.
fur: Met a VÊR par meti in indiç lis cartelis di dispositîfs estraibii montâts.

source: Index optical discs
fur: Met in indiç discs otics

source: Set to true to enable indexing CDs, DVDs, and generally optical media (if removable devices are not indexed, optical discs won’t be either)
fur: Met a VÊR par abilitâ la metude in indiç di CD, DVD e plui in gjenar di dispositîfs otics (se i dispositîfs estraibii no vegnin metûts in indiç alore nancje chei otics lu saran)

source: Index when running on battery
fur: Met in indiç cuant che si va a batarie

source: Set to true to index while running on battery
fur: Met a VÊR par meti in indiç cuant che si funzione alimentâts a batarie

source: Perform initial indexing when running on battery
fur: Eseguìs la metude in indiç iniziâl cuant che si va a batarie

source: Set to true to index while running on battery for the first time only
fur: Met a VÊR par meti in indiç nome pe prime volte cuant che si è alimentâts a batarie

source: Directories to index recursively
fur: Cartelis di meti in indiç in maniere ricorsive

source: List of directories to index recursively, Special values include: &amp;DESKTOP, &amp;DOCUMENTS, &amp;DOWNLOAD, &amp;MUSIC, &amp;PICTURES, &amp;PUBLIC_SHARE, &amp;TEMPLATES, &amp;VIDEOS. See /etc/xdg/user-dirs.defaults and $HOME/.config/user-dirs.default
fur: Liste di cartelis di meti in indiç in maniere ricorsive, i valôrs speciâi a son: &amp;DESKTOP, &amp;DOCUMENTS, &amp;DOWNLOAD, &amp;MUSIC, &amp;PICTURES, &amp;PUBLIC_SHARE, &amp;TEMPLATES, &amp;VIDEOS. Consultâ /etc/xdg/user-dirs.defaults e $HOME/.config/user-dirs.default

source: Directories to index non-recursively
fur: Cartelis di meti in indiç in maniere no ricorsive

source: List of directories to index without inspecting subfolders, Special values include: &amp;DESKTOP, &amp;DOCUMENTS, &amp;DOWNLOAD, &amp;MUSIC, &amp;PICTURES, &amp;PUBLIC_SHARE, &amp;TEMPLATES, &amp;VIDEOS. See /etc/xdg/user-dirs.defaults and $HOME/.config/user-dirs.default
fur: Liste di cartelis di meti in indiç cence ispezionâ lis sotcartelis, i valôrs speciâi a son: &amp;DESKTOP, &amp;DOCUMENTS, &amp;DOWNLOAD, &amp;MUSIC, &amp;PICTURES, &amp;PUBLIC_SHARE, &amp;TEMPLATES, &amp;VIDEOS. Consultâ /etc/xdg/user-dirs.defaults e $HOME/.config/user-dirs.default

source: Ignored files
fur: File ignorâts

source: List of file patterns to avoid
fur: Liste di modei di file di ignorâ

source: Ignored directories
fur: Cartelis ignoradis

source: List of directories to avoid
fur: Liste di cartelis di ignorâ

source: Ignored directories with content
fur: Cartelis cun contignût di ignorâ

source: Avoid any directory containing a file blacklisted here
fur: Ignore cualsisei cartele che e conten un file chi listât

source: Initial sleep time in seconds, 0->1000 (default=15)
fur: Pause iniziâl in seconts, 0→100 (predefinît=15)

source: Runs until all configured locations are indexed and then exits
fur: Reste in esecuzion fintremai che dutis lis posizions configuradis no sedin metudis in indiç, daspò jes

source: Checks if FILE is eligible for being mined based on configuration
fur: Verifiche che al sedi pussibil estrai dâts da FILE in base ae configurazion

source: Data object “%s” currently exists
fur: L'ogjet dâts «%s» al esist za

source: Data object “%s” currently does not exist
fur: L'ogjet dâts «%s» al moment nol esist

source: Directory is eligible to be mined (based on rules)
fur: Al è pussibil analizâ la cartele (in base aes regulis)

source: Directory is NOT eligible to be mined (based on rules)
fur: Nol è pussibil analizâ la cartele (in base aes regulis)

source: Directory is eligible to be mined (based on contents)
fur: Al è pussibil monitorâ la cartele (in base al contignût)

source: Directory is NOT eligible to be mined (based on contents)
fur: Nol è pussibil monitorâ la cartele (in base al contignût)

source: Directory is eligible to be monitored (based on config)
fur: Al è pussibil monitorâ la cartele (in base ae configurazion)

source: Directory is NOT eligible to be monitored (based on config)
fur: Nol è pussibil monitorâ la cartele (in base ae configurazion)

source: File is eligible to be monitored (based on config)
fur: Al è pussibil monitorâ il file (in base ae configurazion)

source: File is NOT eligible to be monitored (based on config)
fur: Nol è pussibil monitorâ il file (in base ae configurazion)

source: File or Directory is eligible to be monitored (based on config)
fur: Al è pussibil monitorâ il file o la cartele (in base ae configurazion)

source: File or Directory is NOT eligible to be monitored (based on config)
fur: Nol è pussibil monitorâ il file o la cartele (in base ae configurazion)

source: File is eligible to be mined (based on rules)
fur: Al è pussibil analizâ il file (in base aes regulis)

source: File is NOT eligible to be mined (based on rules)
fur: Nol è pussibil analizâ il file (in base aes regulis)

source: Would be indexed
fur: Al vegnarà metût in indiç

source: Yes
fur: Sì

source: Would be monitored
fur: Al vegnarà monitorât

source: — start the tracker indexer
fur: — tache tracker chel che al met in indiç

source: Low battery
fur: Batarie cuasi esauride

source: Low disk space
fur: Spazi disc cuasi esaurît

source: Tracker File System Miner
fur: Estratôr di dâts dal file system Tracker

source: Crawls and processes files on the file system
fur: Cjape sù dâts e elabore file sul file system

source: RSS/ATOM Feeds
fur: Feed RSS/ATOM

source: Fetch RSS/ATOM Feeds
fur: Scjarie feed RSS/ATOM

source: Add feed
fur: Zonte feed

source: Title to use (must be used with --add-feed)
fur: Titul di doprâ (al scugne jessi doprât cun --add-feed)

source: — start the feeds indexer
fur: — tache chel che al met in indiç i feed

source: Could not establish a connection to Tracker
fur: Impussibil stabilî une conession cun Tracker
kk: Трекерге қосылу мүмкін болмады

source: Could not add feed
fur: Impussibil zontâ il feed

source: Tracker RSS/ATOM Feeds Miner
fur: Estratôr di feed RSS/ATOM Tracker

source: Fetch RSS/ATOM feeds
fur: Scjarie feed RSS/ATOM

source: Userguides
fur: Guidis utent

source: Userguide data miner
fur: Estratôr di dâts des guidis utent

source: — start the user guides data miner
fur: — tache l'estratôr dâts des guidis utent

source: Tracker User Guides Miner
fur: Estratôr di dâts des guidis utent

source: Crawls and processes user guides in shared areas
fur: Cjape sù dâts e elabore lis guidis utent te aree condividude

source: Emails
fur: E-mail

source: Evolution Email miner
fur: Estratôr di dâts e-mail Evolution

source: Push data to Tracker to make it queryable.
fur: Invie i dâts a Tracker par rindiju disponibii.

source: Processing…
fur: Elaborazion...

source: Tags
fur: Etichetis

source: _Set the tags you want to associate with the %d selected item:
fur: _Met lis etichetis di associâ cun %d element selezionât:

source: Extractor
fur: Estratôr

source: Metadata extractor
fur: Estratôr di meta-dâts

source: Max bytes to extract
fur: Numar massim di byte di estrai

source: Maximum number of UTF-8 bytes to extract.
fur: Numar massim di byte UTF-8 di estrai.

source: Max media art width
fur: Largjece massime des figuris

source: Maximum width in pixels for any media art extracted. Anything bigger is resized. Set to -1 to disable saving media art from files. Setting to 0 sets no limit on the media art width.
fur: Massime largjece in pixel des figuris estratis, cualsisei file plui grant al ven ridimensionât. Met a -1 par disabilitâ il salvament des figuris, met a 0 par disabilitâ il limit su la largjece.

source: Wait for FS miner to be done before extracting
fur: Spiete che l'analizadôr dal file system al finissi prime di estrai

source: When true, tracker-extract will wait for tracker-miner-fs to be done crawling before extracting meta-data. This option is useful on constrained environment where it is important to list files as fast as possible and can wait to get meta-data later.
fur: Se VÊR, tracker-extract al spietarà che tracker-miner-fs al finissi prime di estrai i meta-dâts. Cheste opzion e je utile sui sistemis limitâts dulà che al è impuartant listâ i file in maniere veloce e al è pussibil spietâ il recupar dai meta-dâts.

source: Metadata extraction failed
fur: Estrazion dai meta-dâts falide

source: No metadata or extractor modules found to handle this file
fur: Nol è stât cjatât nissun modul par meta-dâts o di estrazion par gjestî chest file

source: Logging, 0 = errors only, 1 = minimal, 2 = detailed and 3 = debug (default = 0)
fur: Regjistrazion: 0 = nome erôrs, 1 = minimâl, 2 = detaiade, 3 = debug (predefinît = 0)

source: File to extract metadata for
fur: File di dulà tirâ fûr i metadâts

source: MIME type for file (if not provided, this will be guessed)
fur: Gjenar di MIME pal file (se no furnît al ven intuît)

source: Force a module to be used for extraction (e.g. “foo” for “foo.so”)
fur: Sfuarce l'ûs di un modul pe estrazion (par esempli «cjossul» par «cjossul.so»)

source: MODULE
fur: MODUL

source: Output results format: “sparql”, or “turtle”
fur: Formât dai risultâts di jessude: «sparql», o «turtle»

source: FORMAT
fur: FORMÂT

source: Unsupported serialization format “%s”
fur: Formât «%s» di serializazion no supuartât
kk: Қолдау көрсетілмейтін «%s» сериализация пішімі

source: — Extract file meta data
fur: — Al tire fûr i meta-dâts dai file

source: Filename and mime type must be provided together
fur: Il non file e il gjenar di mime a scugnin jessi furnîts adun

source: Tracker Metadata Extractor
fur: Estratôr di meta-dâts Tracker

source: Extracts metadata from local files
fur: Al tire fûr i meta-dâts dai file locâi

source: Default View
fur: Visualizazion predefinide

source: When 0, default view of tracker-needle will be Icons view. When 1, default view of tracker-needle will be Categories view. When 2, default view of tracker-needle will be Files view.
fur: Cuant che al è metût a 0, la viodude predefinide di tracker-needle e sarà chê a iconis; cuant che al è metût a 1 e sarà chê a categoriis e cuant che al è metût a 2 chê a file.

source: Desktop Search
fur: Ricercje scritori

source: Find what you’re looking for on this computer by name or content using Tracker
fur: Cjate, doprant Tracker, ce che tu stâs cirint su chest computer, par non o par contignût

source: Display results by category, for example, Music, Videos, Applications, etc. This includes searching the contents of files where applicable.
fur: Mostre i risultâts par categorie, par esempli Musiche, Videos, Aplicazions, e vie indenant. Chest al inclût la ricercje sui contignûts dai file dulà pussibil.

source: Display results by files found in a list
fur: Mostre i risultâts in base ai file cjatâts intune liste

source: Display found images
fur: Mostre lis imagjins cjatadis

source: Find search criteria inside files
fur: Cîr criteri di ricercje dentri dai file

source: Find search criteria in file titles
fur: Cîr criteri di ricercje tai titui dai file

source: Find search criteria in file tags only (separated by comma)
fur: Cîr criteri di ricercje nome tes etichetis dai file (separadis di virgule)

source: _Search:
fur: _Cîr:

source: Show tagging panel which allows editing tags of selected results
fur: Mostre il panel des etichetis che al permet di modificâ lis etichetis dai risultâts selezionâts

source: Show statistics about the data stored
fur: Mostre statistichis sui dâts memorizâts

source: _Set the tags you want to associate with the %d selected items:
fur: _Met lis etichetis di associâ cui elements selezionâts:

source: Add tag
fur: Zonte etichete

source: Remove selected tag
fur: Gjave la etichete selezionade

source: Search criteria was too generic
fur: Il criteri di ricercje al jere masse gjeneric

source: Only the first 500 items will be displayed
fur: Nome i prins 500 elements a vegnaran mostrâts

source: Print version
fur: Stampe version

source: [SEARCH-CRITERIA]
fur: [CRITERI-RICERCJE]

source: Desktop Search user interface using Tracker
fur: Interface pe ricercje scritori Tracker

source: The statistics represented here do not reflect their availability, rather the total data stored:
fur: Lis statistichis mostradis chi no corispuindin ae reâl disponibilitât, ma il totâl dai dâts archiviâts:

source: Tag
fur: Etichete

source: Contact
fur: Contat

source: Folder
fur: Cartele

source: Image
fur: Imagjin

source: Application
fur: Aplicazion

source: Music Track
fur: Toc di musiche

source: Photo
fur: Foto

source: Playlist
fur: Liste di musiche

source: Bookmark
fur: Segnelibri

source: Name
fur: Non

source: No items currently selected
fur: Nissun element al moment selezionât

source: Could not update tags
fur: Impussibil inzornâ lis etichetis

source: Could not remove tag
fur: Impussibil gjavâ la etichete

source: Could not retrieve tags for the current selection
fur: Impussibil otignî lis etichetis pe selezion atuâl

source: Could not add tag
fur: Impussibil zontâ la etichete

source: Could not update tags for file
fur: Impussibil inzornâ lis etichetis pal file

source: Today
fur: Vuê

source: Tomorrow
fur: Doman

source: Yesterday
fur: Îr

source: %ld day from now
fur: %ld dì di cumò

source: %ld day ago
fur: %ld dì indaûr

source: Less than one second
fur: Mancul di un secont

source: No Search Results
fur: Nissun risultât

source: Select the view on the toolbar for the content you want, e.g. everything, files or just images
fur: Selezione la viodude su la sbare dai struments pal contignût che tu vûs, par esempli file o nome imagjins

source: Start to search using the entry box above
fur: Tache a cirî doprant la casele di test chi parsore

source: Last Changed
fur: Ultime modifiche

source: Size
fur: Dimension

source: Music
fur: Musiche

source: Images
fur: Imagjins

source: Mail
fur: Pueste

source: Folders
fur: Cartelis

source: Bookmarks
fur: Segnelibris

source: Items
fur: Elements

source: Loading…
fur: Daûr a cjamâ...

source: %d Page
fur: %d pagjine

source: _Show Parent Directory
fur: _Mostre cartele superiôr

source: _Tags…
fur: E_tichetis...

source: Search and Indexing
fur: Ricercje e metude in indiç

source: Configure file indexing with Tracker
fur: Configure la metude in indiç dai file cun Tracker

source: Indexing Preferences
fur: Preferencis de metude in indiç

source: _Monitor file and directory changes
fur: _Monitorâ i cambiaments di file e cartelis

source: Enable when running on _battery
fur: Abilite a alimentazion a _batarie

source: Enable for _initial data population
fur: Abilite pal popolament _iniziâl dai dâts

source: Include _removable media
fur: Includi i supuarts est_raibii

source: This covers ALL removable media, memory cards, CDs, DVDs, etc.
fur: Chest al inclût DUCJ i supuarts estraibii, schedis di memorie, CD, DVD e vie indenant

source: Include optical di_scs
fur: Includi i di_scs otics

source: Semantics
fur: Semantichis

source: The scheduler is the kernel component that decides which runnable application will be executed by the CPU next. Each application has an associated scheduling policy and priority. This option allows you to make Tracker take a back seat and not eat up too much CPU time if you have other applications more deserving of it.
fur: Il planificadôr (scheduler) al è chel component dal kernel che al decît cuale aplicazion e vegnarà eseguide subite dopo su la CPU. Ogni aplicazion e à assegnade une politiche di planificazion e une prioritât. Cheste opzion e fâs in mût che Tracker nol dopri masse la CPU in presince di aplicazions che a'nd' àn plui dibisugne.

source: Index content in the background:
fur: Met in indiç il contignût in background:

source: O_nly when computer is not being used
fur: Nome cuant che il computer _nol è doprât

source: Indexing content will be <b>much slower</b> but other applications will have priority.
fur: La metude in indiç dai contignûts e sarà <b>une vore plui lente</b>, ma lis altris aplicazions a varan prioritât.

source: _While other applications are running, except for initial data population
fur: _Intant che lis altris aplicazions a son in esecuzion, infûr che pal popolament iniziâl dai dâts

source: Indexing content will be <b>much slower</b> but other applications will have priority. This will only be the case on the <b>first index</b> of your content after you start your computer from a new install
fur: La metude in indiç dai contignûts e sarà <b>une vore plui lente</b>, ma lis altris aplicazions a varan prioritât. Chest si apliche nome ae <b>prime metude in indiç</b> dal contignût al inviament dal computer di une gnove instalazion

source: While _other applications are running
fur: Intant che lis _altris aplicazions a son in esecuzion

source: Indexing content will be as <b>fast</b> as possible but other applications may suffer and be slower as a result.
fur: La metude in indiç dai contignûts e sarà la plui <b>veloce</b> pussibile, ma lis altris aplicazions e podaressin risultâ plui lentis.

source: Stop indexing when _disk space is below:
fur: Ferme la metude in indiç cuant che il spazi _disc al è inferiôr a:

source: Limitations
fur: Limitazions

source: Indexed content from removable devices that have not been inserted for a while, are cleaned up to avoid build up of unused resources.
fur: I contignûts metûts in indiç dai dispositîfs estraibii no tacâts di resint a vegnaran netâts par limitâ l'ûs des risorsis disponibilis.
