Repository: GNOME/tinysparql
Catalog: po/*.po
Languages: fur, kk

source: Days before deleting removable devices:
fur: Dîs prime di eliminâ dispositîfs estraibii:

source: Garbage Collection
fur: Colezion scovacis

source: Indexing
fur: Metude in indiç

source: Special locations such as your <b>Home</b>, <b>Desktop</b> or <b>Documents</b> directory, can be easily toggled below. This will add or remove their real paths from the list underneath. If a directory is toggled to <b>Recurse</b>, it means that all sub-directories underneath it will also be indexed. Otherwise, only files immediately in that directory will be indexed.
fur: Posizions speciâi come lis cartelis <b>Cjase</b>, <b>Scritori</b> o <b>Documents</b>, a puedin jessi abilitadis chi sot. Chest al zontarà o al gjavarà il lôr percors reâi de liste chi parsot. Se par une cartele e je abilitade la vôs <b>Ricors</b>, dutis lis sot-cartelis al so interni a vegnaran metudis in indiç, se no nome i siei file disponibii lu saran.

source: Index Home Directory
fur: Met in indiç la cartele Cjase

source: Index Desktop Directory
fur: Met in indiç la cartele Scritori

source: Index Documents Directory
fur: Met in indiç la cartele Documents

source: Index Music Directory
fur: Met in indiç la cartele Musiche

source: Index Pictures Directory
fur: Met in indiç la cartele Imagjins

source: Index Videos Directory
fur: Met in indiç la cartele Videos

source: Index Download Directory
fur: Met in indiç la cartele Discjariâts

source: One or more special locations have the same path. Those which are the same are disabled!
fur: Une o plui posizions speciâi a àn il medesim percors. Chês compagnis a vegnin disabilitadis!

source: Add directory to be indexed
fur: Zontâ une cartele di meti in indiç

source: Remove directory from being indexed
fur: Gjave une cartele dal indiç

source: Where is your content?
fur: Dulà isal il to contignût?

source: Locations
fur: Posizions

source: Glob patterns to ignore:
fur: Modei glob di ignorâ:

source: Opens text entry for glob patterns
fur: Al vierç la casele di test pai modei glob

source: Opens the filechooser dialogue
fur: Al vierç il dialic seletôr di file

source: With specific files:
fur: Cun file specifics:

source: Directories
fur: Cartelis

source: Globbing patterns can be used here, for example: “*bar*”. Most commonly this is used to ignore directories like *~, *.o, *.la, etc
fur: Al è pussibil doprâ modei di coincidence cun caratars speciâi, par esempli: «*bar*». Di solit chest al ven doprât par ignorâ cartelis come *~, *.o, *.la, e vie indenant

source: Files
fur: File

source: Ignored Content
fur: Contignût ignorât

source: Index content of _files found
fur: Meti in indiç il contignût dai _file cjatâts

source: Index _numbers
fur: Meti in indiç i _numars

source: What is indexed?
fur: Ce isal metût in indiç?

source: Directory
fur: Cartele

source: Some of the requested changes will take effect on the next session restart.
fur: Cualchidun dai cambiaments domandâts a varan efiet al prossim inviament di session.

source: Disabled
fur: Disabilitât

source: Enter value
fur: Inserî valôr

source: _Cancel
fur: _Anule

source: Select directory
fur: Selezione cartele

source: That directory is already selected as a location to index
fur: Chê cartele e je za selezionade come posizion di meti in indiç

source: Recurse
fur: Ricors

source: Desktop Search preferences
fur: Preferencis di ricercje scritori

source: Force a re-index of all content
fur: Sfuarce un tornâ a meti in indiç di ducj i contignûts

source: Only allow read based actions on the database
fur: Al permet nome operazions di leture su la base di dâts

source: — start the tracker daemon
fur: — invie il demoni di Tracker

source: Tracker Store
fur: Archivi di Tracker

source: Metadata database store and lookup manager
fur: Archivi de base di dâts dai meta-dâts e gjestôr des ricercjs

source: GraphUpdated delay
fur: Ritart GraphUpdated

source: Period in milliseconds between GraphUpdated signals being emitted when indexed data has changed inside the database.
fur: Periodi in miliseconts tra la emission di segnâi GraphUpdated cuant che i dâts metûts in indiç a son stâts modificâts te base di dâts.

source: Could not get GSettings for miners, manager could not be created, %s
fur: Impussibil otignî GSettings pai estratôrs, il gjestôr nol pues jessi creât, %s

source: Unavailable
fur: No disponibil

source: Initializing
fur: Daûr a inizializâ

source: Fetching…
fur: Daûr a recuperâ...

source: Crawling single directory “%s”
fur: Daûr a cjapâ sù dâts nome pe cartele «%s»

source: Crawling recursively directory “%s”
fur: Daûr a cjapâ sù dâts in maniere ricorsive pe cartele «%s»

source: Paused
fur: Interot

source: Idle
fur: Inatîf

source: Follow status changes as they happen
fur: Seguìs i cambiaments di stât apene che a sucedin

source: Watch changes to the database in real time (e.g. resources or files being added)
fur: Ten di voli i cambiaments ae base di dâts in timp reâl (come risorsis o file zontâts)

source: ONTOLOGY
fur: ONTOLOGJIE

source: List common statuses for miners and the store
fur: Liste i stâts comuns pai estratôrs e l'archivi

source: Pause a miner (you must use this with --miner)
fur: Interomp un estratôr (al à di jessi doprât cun --miner)

source: REASON
fur: RESON

source: Pause a miner while the calling process is alive or until resumed (you must use this with --miner)
fur: Al interomp un estratôr intant che il procès clamant al è ancjemò atîf o fintremai che nol è stât ripristinât (al à di jessi doprât cun --miner)

source: Resume a miner (you must use this with --miner)
fur: Al torne a meti in vore un estratôr (al à di jessi doprât cun --miner)

source: Miner to use with --resume or --pause (you can use suffixes, e.g. Files or Applications)
fur: Estratôr di doprâ cun --resume o --pause (al è pussibil doprâ sufìs come "File" o "Aplicazions")

source: MINER
fur: ESTRATÔR

source: List all miners currently running
fur: Liste ducj i estratôrs in esecuzion

source: List all miners installed
fur: Liste ducj i estratôrs instalâts

source: List pause reasons
fur: Liste i motîfs di interuzion

source: List all Tracker processes
fur: Liste ducj i procès di Tracker

source: Use SIGKILL to stop all matching processes, either “store”, “miners” or “all” may be used, no parameter equals “all”
fur: Dopre SIGKILL par fermâ ducj i procès corispuindints; a puedin jessi doprâts «store», «miners» o «all», cence parametris al vûl dî «all»

source: APPS
fur: APLICAZIONS

source: Use SIGTERM to stop all matching processes, either “store”, “miners” or “all” may be used, no parameter equals “all”
fur: Dopre SIGTERM par fermâ ducj i procès corispuindints; a puedin jessi doprâts «store», «miners» o «all», cence parametris al vûl dî «all»

source: Starts miners (which indirectly starts tracker-store too)
fur: Invie i estratôrs (al ven inviât ancje tracker-store)

source: Sets the logging verbosity to LEVEL (“debug”, “detailed”, “minimal”, “errors”) for all processes
fur: Al met il nivel di detais dal regjistri par ducj i procès a NIVEL(«debug», «detailed», «minimal», «errors»)

source: LEVEL
fur: NIVEL

source: Show logging values in terms of log verbosity for each process
fur: Mostre i valôrs di regjistrazion in tiermins di regjistri detaiât par ogni procès

source: Could not get status from miner: %s
fur: Impussibil otignî il stât dal estratôr: %s

source: %s remaining
fur: ancjemò %s

source: unknown time left
fur: timp restant no cognossût

source: PAUSED
fur: INTEROT

source: Not running or is a disabled plugin
fur: No in esecuzion o plugin disabilitât

source: Could not retrieve tracker-store status
fur: Impussibil otignî il stât di tracker-store

source: Could not retrieve tracker-store progress
fur: Impussibil otignî l'avanzament di tracker-store

source: Unable to retrieve namespace prefixes
fur: Impussibil otignî i prefìs di namespace

source: No namespace prefixes were returned
fur: Nissun prefìs di namespace cjatât

source: Could not run SPARQL query
fur: Impussibil eseguî la interogazion SPARQL

source: Could not call tracker_sparql_cursor_next() on SPARQL query
fur: Impussibil clamâ tracker_sparql_cursor_next() su la interogazion SPARQL

source: Could not pause miner, manager could not be created, %s
fur: Impussibil interompi l'estratôr, il gjestôr nol pues jessi creât, %s

source: Attempting to pause miner “%s” with reason “%s”
fur: Tentatîf di interompi l'estratôr «%s» cun la reson «%s»

source: Could not pause miner: %s
fur: Impussibil interompi l'estratôr: %s

source: Cookie is %d
fur: Il cookie al è %d

source: Press Ctrl+C to stop
fur: Frache Ctrl+C par fermâ

source: Could not resume miner, manager could not be created, %s
fur: Impussibil tornâ a meti in vore l'estratôr, il gjestôr nol pues jessi creât, %s

source: Attempting to resume miner %s with cookie %d
fur: Tentatîf di tornâ a meti in vore l'estratôr %s cul cookie %d

source: Could not resume miner: %s
fur: Impussibil tornâ a meti in vore l'estratôr: %s

source: Done
fur: Fat
kk: Болды

source: Could not list miners, manager could not be created, %s
fur: Impussibil elencâ i estratôrs, il gjestôr nol pues jessi creât, %s

source: Found %d miner installed
fur: Cjatât %d estratôr dâts instalât

source: Found %d miner running
fur: Cjatât %d estratôr dâts in esecuzion

source: Could not get pause details, manager could not be created, %s
fur: Impussibil otignî i detais de interuzion, il gjestôr nol pues jessi creât, %s

source: No miners are running
fur: Nissun estratôr in esecuzion

source: Miners
fur: Estratôrs dâts

source: Reason
fur: Reson

source: No miners are paused
fur: Nissun estratôr dâts interot

source: Only one of “all”, “store” and “miners” options are allowed
fur: E je permetude nome une tra lis opzions «all», «store» e «miners»

source: Could not get SPARQL connection
fur: Impussibil otignî une conession SPARQL

source: Now listening for resource updates to the database
fur: In scolte par inzornaments des risorsis su la base di dâts

source: All nie:plainTextContent properties are omitted
fur: Dutis lis proprietâts nie:plainTextContent a son ometudis

source: Common statuses include
fur: I stâts comuns a includin

source: Could not get status, manager could not be created, %s
fur: Impussibil otignî il stât, il gjestôr nol pues jessi creât, %s

source: Store
fur: Archivi

source: Could not get display name for miner “%s”
fur: Impussibil otignî il non pal estratôr «%s»

source: You can not use miner pause and resume switches together
fur: Nol è pussibil doprâ lis opzions di interuzion e di ripristinament parie

source: You must provide the miner for pause or resume commands
fur: Si scugne furnî l'estratôr pai comants di interuzion o di ripristinament

source: You must provide a pause or resume command for the miner
fur: Si scugne furnî un comant di interuzion o di ripristinament pal estratôr

source: You can not use the --kill and --terminate arguments together
fur: Nol è pussibil doprâ adun i argoments --kill e --terminate

source: You can not use the --get-logging and --set-logging arguments together
fur: Nol è pussibil doprâ adun i argoments --get-logging e --set-logging

source: Invalid log verbosity, try “debug”, “detailed”, “minimal” or “errors”
fur: Nivel di detais dal regjistri no valit, prove «debug», «detailed», «minimal» o «errors»

source: Found process ID %d for “%s”
fur: Cjatât ID di procès %d par «%s»

source: Only those with config listed
fur: Nome chei cuntune configurazion in liste

source: Setting log verbosity for all components to “%s”…
fur: Daûr a stabilî il nivel di detais dal regjistri par ducj i components a «%s»...

source: Starting miners…
fur: Daûr a inviâ i estratôrs dâts...

source: Could not start miners, manager could not be created, %s
fur: Impussibil inviâ i estratôrs, il gjestôr nol pues jessi creât, %s

source: perhaps a disabled plugin?
fur: salacor un plugin disabilitât?

source: If no arguments are given, the status of the store and data miners is shown
fur: Cence argoments, al ven mostrât il stât dal archivi e dai estratôrs

source: Unrecognized options
fur: Opzions no ricognossudis
kk: Танылмаған параметрлер

source: Could not get D-Bus connection
fur: Impussibil otignî une conession D-Bus

source: Could not create D-Bus proxy to tracker-store
fur: Impussibil creâ un proxy D-Bus viers tracker-store

source: Could not run tracker-extract:
fur: Impussibil eseguî tracker-extract:

source: failed to exec “%s”: %s
fur: no si è rivâts a eseguî «%s»: %s

source: Tell miners to reindex files which match the mime type supplied (for new extractors), use -m MIME1 -m MIME2
fur: Dîs ai estratôrs di tornâ a meti in indiç i file che a corispuindin al gjenar mime furnît (pai gnûfs estratôrs), dopre -m MIME1 -m MIME2

source: Tell miners to (re)index a given file
fur: Dîs ai estratôrs di (torna a)meti in indiç un file furnît

source: Backup current index / database to the file provided
fur: Fâs il backup de base di dâts/indiç sul file furnît

source: Restore a database from a previous backup (see --backup)
fur: Torne met une base di dâts di un backup precedent (viôt --backup)

source: Import a dataset from the provided file (in Turtle format)
fur: Impuarte une base di dâts dal file furnît (in formât Turtle)

source: Could not reindex mimetypes, manager could not be created, %s
fur: Impussibil tornâ a meti in indiç i gjenars MIME, il gjestôr nol pues jessi creât, %s

source: Could not reindex mimetypes
fur: Impussibil tornâ a meti in indiç i gjenars MIME

source: Reindexing mime types was successful
fur: Il tornâ a meti in indiç dai gjenars di MIME al è lât a bon fin

source: Could not (re)index file, manager could not be created, %s
fur: Impussibil (tornâ a)meti in indiç il file, il gjestôr nol pues jessi creât, %s

source: Could not (re)index file
fur: Impussibil (tornâ a)meti in indiç il file

source: (Re)indexing file was successful
fur: Il (tornâ a)meti in indiç al è lât a bon fin

source: Importing Turtle file
fur: Daûr a impuartâ l'archivi Turtle

source: Unable to import Turtle file
fur: Impussibil impuartâ il file Turtle

source: Backing up database
fur: Daûr a fâ il backup de base di dâts

source: Could not backup database
fur: Impussibil fâ il backup de base di dâts

source: Restoring database from backup
fur: Daûr a tornâ a meti la base di dâts dal backup

source: Only one action (--backup, --restore, --index-file or --import) can be used at a time
fur: A pues jessi doprade nome une azion ae volte (--backup, --restore, --index-file o --import)

source: Missing one or more files which are required
fur: A mancjin un o plui file necessaris

source: Only one file can be used with --backup and --restore
fur: Nome un file al pues jessi doprât cun --backup e --restore

source: Actions (--backup, --restore, --index-file and --import) can not be used with --reindex-mime-type
fur: Azions (--backup, --restore, --index-file e --import) no puedin jessi dopradis cun --reindex-mime-type

source: Show full namespaces (i.e. don’t use nie:title, use full URLs)
fur: Mostre il namespace complet (p.e. no doprâ nie:titul, doprâ i URL complets)

source: Show plain text content if available for resources
fur: Mostre, se disponibii, i contignûts in test sempliç pes risorsis

source: Instead of looking up a file name, treat the FILE arguments as actual IRIs (e.g. <file:///path/to/some/file.txt>)
fur: Al puest di cirî un non di file, dopre i argoments FILE come dai IRI (p.e. <file:///percors/a/cualchi/file.txt>)

source: Output results as RDF in Turtle format
fur: Da fûr i risultâts come RDF in formât Turtle

source: Querying information for entity
fur: Daûr a consultâ la informazion pe entitât

source: Unable to retrieve URN for URI
fur: Impussibil otignî il URN pal URI

source: Unable to retrieve data for URI
fur: Impussibil otignî dâts pal URI

source: No metadata available for that URI
fur: Nissun meta-dât disponibil par chel URI

source: Results
fur: Risultâts
kk: Нәтижелер

source: See “tracker help <command>” to read about a specific subcommand.
fur: Consultâ «tracker help <command>» par informazions su un specific sot-comant.

source: Start, stop, pause and list processes responsible for indexing content
fur: Tache, ferme, met in pause e liste i procès responsabii pe metude in indiç dai contignûts

source: Extract information from a file
fur: Tire fûr informazions di un file

source: Get help on how to use Tracker and any of these commands
fur: Oten informazions sul ûs di Tracker e cualsisei di chescj comants

source: Show information known about local files or items indexed
fur: Mostre informazions cognossudis in merit ai file locâi o ai elements metûts in indiç

source: Backup, restore, import and (re)index by MIME type or file name
fur: Fâs il backup, ripristine, impuarte e (torne a meti)met in indiç par gjenar di MIME o par non di file

source: Reset or remove index and revert configurations to defaults
fur: Ripristine o gjave l'indiç e torne a lis configurazions predefinidis

source: Search for content indexed or show content by type
fur: Cîr contignûts metûts in indiç o mostre il contignût par gjenar

source: Query and update the index using SPARQL or search, list and tree the ontology
fur: Interoghe e inzorne l'indiç doprant SPARQL opûr cîr, liste e met in scjale a arbul la ontologjie

source: Query the database at the lowest level using SQL
fur: Interoghe la base di dâts (a bas nivel) doprant SQL

source: Show the indexing progress, content statistics and index state
fur: Mostre l'avanzament de metude in indiç, lis statistichis e il stât dal indiç

source: Create, list or delete tags for indexed content
fur: Cree, liste o elimine etichetis pai contignûts metûts in indiç

source: Show the license and version in use
fur: Mostre la licence e la version in ûs

source: “%s” is not a tracker command. See “tracker --help”
fur: «%s» nol è un comant tracker. Consultâ «tracker --help»

source: Available tracker commands are:
fur: I comants tracker disponibii a son:

source: Could not open /proc
fur: Impussibil vierzi /proc

source: Could not stat() file
fur: Impussibil eseguî stat() sul file

source: Could not open “%s”
fur: Impussibil vierzi «%s»

source: Could not terminate process %d — “%s”
fur: Impussibil terminâ procès %d — «%s»

source: Terminated process %d — “%s”
fur: Terminât procès %d — «%s»

source: Could not kill process %d — “%s”
fur: Impussibil copâ procès %d — «%s»

source: Killed process %d — “%s”
fur: Copât procès %d — «%s»

source: Kill all Tracker processes and remove all databases
fur: Cope ducj i procès Tracker e gjave dutis lis basis di dâts

source: Same as --hard but the backup & journal are restored after restart
fur: Come --hard ma il backup e il diari a son ripristinâts daspò il gnûf inviament

source: Remove all configuration files so they are re-generated on next start
fur: Gjave ducj i file di configurazion cussì che al prossim inviament a sedin gjenerâts di gnûf

source: Erase indexed information about a file, works recursively for directories
fur: Scancele la informazion metude in indiç in merit di un file, al funzione in maniere ricorsive pes cartelis

source: Deleting…
fur: Daûr a eliminâ...

source: The indexed data for this file has been deleted and will be reindexed again.
fur: I dâts metûts in indiç par chest file a son stâts eliminâts e a vegnaran tornâts a meti in indiç di gnûf.

source: You can not use the --hard and --soft arguments together
fur: Nol è pussibil doprâ adun i argoments --hard e --soft

source: CAUTION: This process may irreversibly delete data.
fur: ATENZION: Chest procès al pues eliminâ dâts par simpri.

source: Although most content indexed by Tracker can be safely reindexed, it can’t be assured that this is the case for all data. Be aware that you may be incurring in a data loss situation, proceed at your own risk.
fur: Ancje se si pues tornâ a meti in indiç in maniere sigure la plui part dai contignûts metûts in indiç di Tracker, nol è dite che al sedi il câs di ducj i dâts. Sta atent che tu podaressis pierdi dâts, continue ma cun to pericul.

source: Are you sure you want to proceed?
fur: Sigûrs di continuâ?

source: [y|N]
fur: [s|N]

source: yes
fur: sì

source: Removing configuration files…
fur: Rimozion file di configurazion...

source: Resetting existing configuration…
fur: Si sta ristabilint la configurazion esistente...

source: Search for files
fur: Cîr file

source: Search for folders
fur: Cîr cartelis

source: Search for music files
fur: Cîr file musicâi

source: Search for music albums (--all has no effect on this)
fur: Cîr album musicâi (--all nol fâs nissun efiet chi)

source: Search for music artists (--all has no effect on this)
fur: Cîr artiscj musicâi (--all nol fâs nissun efiet chi)

source: Search for image files
fur: Cîr file inmagjin

source: Search for video files
fur: Cîr file Video

source: Search for document files
fur: Cîr file di document

source: Search for emails
fur: Cîr e-mail

source: Search for contacts
fur: Cîr contats

source: Search for software (--all has no effect on this)
fur: Cîr software (--all nol fâs nissun efiet chi)

source: Search for software categories (--all has no effect on this)
fur: Cîr categoriis software (--all nol fâs nissun efiet chi)

source: Search for feeds (--all has no effect on this)
fur: Cîr feed (--all nol fâs nissun efiet chi)

source: Search for bookmarks (--all has no effect on this)
fur: Cîr segnelibris (--all nol fâs nissun efiet chi)

source: Limit the number of results shown
fur: Limitâ il numar di risultâts mostrâts

source: Offset the results
fur: Apliche un offset al risultât

source: Use OR for search terms instead of AND (the default)
fur: Dopre OR al puest di AND (predefinît) pai tiermins cirûts

source: Show URNs for results (doesn’t apply to --music-albums, --music-artists, --feeds, --software, --software-categories)
fur: Mostre i URN pai risultâts (no si apliche a --music-albums, --music-artists, --feeds, --software, --software-categories)

source: Return all non-existing matches too (i.e. include unmounted volumes)
fur: Torne ancje dutis lis corispondence no-esistentis (al inclût i volums no montâts)

source: Disable showing snippets with results. This is only shown for some categories, e.g. Documents, Music…
fur: No sta mostrâ i tocs cui risultâts; chest al è mostrât nome par cualchi categorie come Documents, Musiche...

source: Disable Full Text Search (FTS). Implies --disable-snippets
fur: Disabilite la ricercje su dut il test (FTS). Al impliche --disable-snippets

source: Disable color when printing snippets and results
fur: Disabilite i colôrs tal mostrâ i tocs e i risultâts

source: search terms
fur: tiermins di cirî

source: EXPRESSION
fur: ESPRESSION

source: NOTE: Limit was reached, there are more items in the database not listed here
fur: NOTE: si è rivâts al limit, a son altris vôs te base di dâts no listadis chi

source: Could not get search results
fur: Impussibil otignî i risultâts di ricercje

source: No contacts were found
fur: Nol è stât cjatât nissun contat

source: Contacts
fur: Contats

source: No name
fur: Nissun non

source: No E-mail address
fur: Nissune direzion e-mail

source: No emails were found
fur: No je stade cjatade nissune e-mail

source: No files were found
fur: Nol è stât cjatât nissun file

source: No artists were found
fur: Nol è stât cjatât nissun artist

source: Artists
fur: Artiscj

source: No music was found
fur: Nol è stât cjatât nissun toc musicâl

source: Albums
fur: Album

source: No bookmarks were found
fur: Nol è stât cjatât nissun segnelibri

source: No feeds were found
fur: Nol è stât cjatât nissun feed

source: Feeds
fur: Feed

source: No software was found
fur: Nissun software cjatât

source: No software categories were found
fur: No je stade cjatade nissune categorie software

source: Software Categories
fur: Categoriis software
