Repository: GNOME/tinysparql
Catalog: po/kw.po
Languages: kw

source: Location of the database
kw: Tyller a'n sel dherivasow

source: DIR
kw: RESTRENVA

source: Specify the DBus name of this endpoint
kw: Ragnotya an hanow DBus a'n darn ma

source: NAME
kw: HANOW

source: Specify the ontology name used in this endpoint
kw: Ragnotya an hanow devnydhys y'n diwedhva ma

source: Specify a path to an ontology to be used in this endpoint
kw: Ragnotya tyller dhe'n ontoloji rag devnydh y'n diwedhva ma

source: HTTP port
kw: Porth HTTP

source: Whether to only allow HTTP connections in the loopback device
kw: Mar gasa junyansow HTTP hepken y'n devis kabester

source: Use session bus
kw: Devnydhya kyttrin esedhek

source: Use system bus
kw: Devnydhya kyttrin system

source: List SPARQL endpoints available in DBus
kw: Rolya diwedhvaow SPARQL kavadow yn DBus

source: List network-local HTTP SPARQL endpoints
kw: Rolya diwedhvaow SPARQL HTTP rosweyth-leel

source: --list can only be used with --session or --system
kw: --list a yll bos devnydhys hepken gans --session po --system

source: One “ontology” or “ontology-path” option should be provided
kw: Unn dewis “ontology” po “ontology-path” kodh bos provys

source: --http-port cannot be used with --dbus-service
kw: --http-port ny yllir bos devnydhys gans --dbus-service

source: Creating HTTP endpoint at %s…
kw: Ow gul diwedhva HTTP yn %s…

source: Listening to SPARQL commands. Press Ctrl-C to stop.
kw: Ow goslowes orth arghadowyow SPARQL. Tava Ctrl-C rag astel.

source: Closing connection…
kw: Ow degea junyans…

source: Creating endpoint at %s…
kw: Ow gul diwedhva yn %s…

source: Could not own DBus name
kw: Ny yllir perghenna hanow DBus

source: DBus name lost
kw: Hanow DBus kellys

source: Unrecognized options
kw: Dewisyow anaswonys

source: Opening database at %s…
kw: Owth ygeri sel dherivasow yn %s…

source: Creating in-memory database
kw: Ow gul sel dherivasow yn-kov

source: New database created. Use the “--dbus-service” option to share this database on a message bus.
kw: Sel dherivasow nowydh gwrys. Devnydhya an dewis “--dbus-service” rag kevrenna an sel dherivasow ma war'n kyttrin messach.

source: FILE
kw: RESTREN

source: Connects to a DBus service
kw: Junya dhe'n gonis DBus

source: DBus service name
kw: Hanow gonis DBus

source: Output results format: “turtle”, “trig” or “json-ld”
kw: Furvas sewyansow eskorrans: “turtle”, “trig” po “json-ld”

source: RDF_FORMAT
kw: FURVAS_RDF

source: Connects to a remote service
kw: Junya dhe'n gonis pell

source: Remote service URI
kw: URI gonis pell

source: Output TriG format which includes named graph information
kw: Furvas eskorrans TriG ow komprehendya kedhlow tresen henwys

source: Specify one “--database”, “--dbus-service” or “--remote-service” option
kw: Ragnotya unn dewis “--database”, “--dbus-service” or “--remote-service” option

source: No error given
kw: Error vyth

source: Could not establish a connection to Tracker
kw: Ny yllir selya junyans dhe Tracker

source: Unsupported serialization format “%s”
kw: Furvas kesresek anskoodhys “%s”

source: Read TriG format which includes named graph information
kw: Redya furvas TriG ow komprehendya kedhlow tresen henwys

source: Could not run import
kw: Ny yllir eksekutya ynporth

source: Lists all available classes
kw: Rolya oll klassys kavadow

source: Lists all available prefixes
kw: Rolya oll ragelvennow kavadow

source: Lists all classes which notify changes in the database
kw: Rolya oll klassys may gwarnya chanjyow y'n sel dherivasow

source: List indexes used in database to improve performance
kw: Rolya menegennow devnydhys y'n sel dherivasow rag gwellhe tooth

source: Retrieve all named graphs
kw: Kerghes oll tresennow henwys

source: Describe subclasses, superclasses (can be used with -s to highlight parts of the tree and -p to show properties)
kw: Deskrifa isklassys, gorklassys (a yll bos devnydhys gans -s rag golowboyntya darnow a'n gwedhen ha -p rag diskwedhes teythiennow)

source: CLASS
kw: KLASS

source: Lists all available properties
kw: Rolya oll teythiennow kavadow

source: Search for a class or property and display more information (e.g. Document)
kw: Hwilas klass po teythien ha diskwedhes kedhlow moy (r.e. Skrif)

source: CLASS/PROPERTY
kw: KLASS/TEYTHIEN

source: Could not create tree: subclass query failed
kw: Ny yllir gul gwedhen: govyn isklass fyllis

source: Could not create tree: class properties query failed
kw: Ny yllir gul gwedhen: govyn teythiennow klass fyllis

source: Could not search classes
kw: Ny yllir hwilas klassys

source: Classes
kw: Klassys

source: Could not search properties
kw: Ny yllir hwilas teythiennow

source: Properties
kw: Teythiennow

source: Could not list properties
kw: Ny yllir rolya teythiennow

source: Namespaces
kw: Spassow Hanow

source: Could not list classes
kw: Ny yllir rolya klassys

source: Could not find notify classes
kw: Ny yllir kavos klassys gwarnya

source: Notifies
kw: Gwarnya

source: Could not find indexed properties
kw: Ny yllir kavos teythiennow menegys

source: Indexes
kw: Menegennow

source: Could not list named graphs
kw: Ny yllir rolya tresennow henwys

source: Named graphs
kw: Tresennow henwys

source: The --list-properties argument can only be empty when used with the --tree argument
kw: An oberadow --list-properties a yll bos gwag pan devnydhys gans an oberadow --tree

source: Get help on how to use TinySPARQL and any of these commands
kw: Kavos gweres gans fatel yllir devnydhya TinySPARQL ha neb a'n arghadowyow ma

source: Create a SPARQL endpoint
kw: Gul diwedhva SPARQL

source: Export data from a TinySPARQL database
kw: Esperthi data dhyworth sel dherivasow TinySPARQL

source: Import data into a TinySPARQL database
kw: Ynperthi data yn sel dherivasow TinySPARQL

source: Introspect a SPARQL endpoint
kw: Isgweles diwedhva SPARQL

source: Query and update the index using SPARQL
kw: Govyn ha nowedhi an menegva ow devnydhya SPARQL

source: Create a Web IDE to query local databases
kw: Gul IDE Gwi rag govyn selyow dherivasow leel

source: Available tinysparql commands are:
kw: Arghadowyow tinysparql kavadow yw:

source: See “tinysparql help <command>” to read about a specific subcommand.
kw: Gweles “tinysparql help <command>” rag redya a-dro isarghadow komparek.

source: “%s” is not a tinysparql command. See “tinysparql --help”
kw: “%s” na yw arghadow tinysparql. Gweles “tinysparql --help”

source: Path to use to run a query or update from file
kw: Tyller rag devnydh rag eksekutya govyn op nowedhi dhyworth restren

source: SPARQL query
kw: Govyn SPARQL

source: This is used with --query and for database updates only.
kw: Hemma yw devnydhys gans --query ha rag nowedhyansow sel dherivasow hepken.

source: Provides an argument for a query parameter.
kw: Provia arghadow rag parameter govyn.

source: PARAMETER:TYPE:VALUE
kw: PARAMETER:EGHEN:DALGH

source: None
kw: Vyth

source: Invalid argument string %s
kw: Arghadow anewn %s

source: Invalid parameter type for argument %s
kw: Eghen parameter anewn rag arghadow %s

source: Could not get UTF-8 path from path
kw: Ny yllir kavos tyller UTF-8 dhyworth tyller

source: Could not read file
kw: Ny yllir redya restren

source: Could not run update
kw: Ny yllir nowedhi

source: Done
kw: Deu

source: Could not run query
kw: Ny yllir govyn

source: No results found matching your query
kw: Sewyansow vyth kavas owth omdhesedha dha govyn

source: Results
kw: Sewyansow

source: File and query can not be used together
kw: Restren ha govyn ny yllir bos devnydhys war-barth

source: Path to use to run a query from file
kw: Tyller rag devnydh rag govyn dhyworth restren

source: SQL query
kw: Govyn SQL

source: Failed to initialize data manager
kw: Ny yllir dalleth dyghtyer data

source: Empty result set
kw: Sett sewyans gwag

source: A database path must be specified
kw: Tyller sel dherivasow a res

source: Port to listen on
kw: Porth rag goslowes orth

source: Port not specified
kw: Porth anragnotys

source: Creating Web IDE at %s…
kw: Ow gul IDE Gwi yn %s…

source: the|a|an
kw: the|a|an|an|unn|a'n|dhe'n|war'n

source: Version
kw: Versyon
